# Практическая работа по уроку "Организация программ и методы строк"
my_string = input()
print(my_string .upper())
print(my_string .lower())
print(my_string .replace(' ', ''))
print(my_string[0])
print(my_string[-1])

# мой результат:
# обычный текст с верхним регистром и нижним регистром, с пробелами и без, с первым символом строки и последним
# ОБЫЧНЫЙ ТЕКСТ С ВЕРХНИМ РЕГИСТРОМ И НИЖНИМ РЕГИСТРОМ, С ПРОБЕЛАМИ И БЕЗ, С ПЕРВЫМ СИМВОЛОМ СТРОКИ И ПОСЛЕДНИМ
# обычный текст с верхним регистром и нижним регистром, с пробелами и без, с первым символом строки и последним
# обычныйтекстсверхнимрегистроминижнимрегистром,спробеламиибез,спервымсимволомстрокиипоследним
# о
# м